package com.samurai.javaBegginerCharter1;

import java.util.Random;

/**
 * Создать массив, заполнить его случайными элементами, распечатать,
 * перевернуть, и снова распечатать (при переворачивании нежелательно создавать
 * еще один массив).
 */
public class example15 {
    public static void main(String[] args) {
        Random rand = new Random();
        int[] array = rand.ints(10, 0, 15).toArray();

        for (int i = 0; i < array.length; i++) {
            System.out.print(array[i] + " ");
        }

        System.out.println();

        for (int i = array.length - 1; i >= 0; i--) {
            System.out.print(array[i] + " ");
        }
    }
}
